[
  {
    "url": "https://brainboost.de/en/",
    "date": "Summer 2021",
    "name": "Intern at Brainboost, a Neurofeedback startup / clinic.",
    "description": "Implemented algorithms for connectivity analysis and visualization of EEG data for patient diagnosis and research with machine learning applications. Re-factored the analysis, report-generating and data collection + processing pipeline."
  },
  {
    "url": "https://github.com/dcxSt/pfb-mod",
    "date": "Summer 2021",
    "name": "Inverting the Polyphase Filter Bank.",
    "description": "The polyphase filter bank is essentially a down-sampled spectrogram with overlapping windows that is commonly used in radio astronomy to channelize data. Notably in telescopes such as CHIME and HIRAX for detecting fast radio bursts. In collaboration with prof Jonathan Seivers, I developed and tested methods for cleanly and efficiently inverting the PFB. This will make further analysis of FRB's, including locating them in deep space, more tractable."
  },
  {
    "url": "https://stephenfay.xyz",
    "date": "Fall 2021",
    "name": "This website.",
    "description": "This website exists to store information about it's self, for instance: <<this website was created in Fall 2021, the url is stephenfay.xyz, and I somtimes make posts about the website in the website, for instance I may make a post that goes something like this: <<this website was created in Fall 2021, the url is stephenfay.xyz, and I sometimes make posts about the website it's self......(ad infinitum).....>> >>"
  },
  {
    "url": "https://github.com/dcxSt",
    "date": "Summer 2020",
    "name": "Math Research Project.",
    "description": "On lie groups and computational solutions to symplectic ordinary differential equations. Under the supervision of Gantumur Tsogtgerel."
  },
  {
    "url": "https://ieeexplore.ieee.org/document/9283117",
    "date": "Fall 2020",
    "name": "Neurotech-X McGill",
    "description": "We built an EMG armband that lets you type on a virtual keyboard."
  },
  {
    "url": "https://arxiv.org/abs/2103.05353",
    "date": "Summer 2019",
    "name": "Recallibrating sunspot series.",
    "description": "Quality control and analysis of recently digitized historical database for the Sunspot Index and Long-term Solar Observation experiment."
  }
]
